
[
  {
    "shloka": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
    "meaning": "You have a right to perform your prescribed duty, but not to the fruits of actions. Never consider yourself to be the cause of the results of your activities, and never be attached to not doing your duty.",
    "source": "Bhagavad Gita 2.47"
  },
  {
    "shloka": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
    "meaning": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
    "source": "Bhagavad Gita 2.48"
  },
  {
    "shloka": "दूरेण ह्यवरं कर्म बुद्धियोगाद्धनञ्जय। बुद्धौ शरणमन्विच्छ कृपणाः फलहेतवः॥",
    "meaning": "O Dhananjaya, keep all abominable activities at a distance by devotional service, and in that consciousness surrender unto the Lord. Those who want to enjoy the fruits of their work are misers.",
    "source": "Bhagavad Gita 2.49"
  },
  {
    "shloka": "बुद्धियुक्तो जहातीह उभे सुकृतदुष्कृते। तस्माद्योगाय युज्यस्व योगः कर्मसु कौशलम्॥",
    "meaning": "A man engaged in devotional service rids himself of both good and bad reactions even in this life. Therefore strive for yoga, which is the art of all work.",
    "source": "Bhagavad Gita 2.50"
  },
  {
    "shloka": "गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः। न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः॥",
    "meaning": "The wise grieve neither for the living nor for the dead. Never was there a time when I did not exist, nor you, nor all these kings; nor in the future shall any of us cease to be.",
    "source": "Bhagavad Gita 2.11-12"
  },
  {
    "shloka": "देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
    "meaning": "As the embodied soul continuously passes, in this body, from boyhood to youth to old age, the soul similarly passes into another body at death. A sober person is not bewildered by such a change.",
    "source": "Bhagavad Gita 2.13"
  },
  {
    "shloka": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥",
    "meaning": "As a man puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up the old and useless ones.",
    "source": "Bhagavad Gita 2.22"
  },
  {
    "shloka": "जातस्य हि ध्रुवो मृत्युर्ध्रुवं जन्म मृतस्य च। तस्मादपरिहार्येऽर्थे न त्वं शोचितुमर्हसि॥",
    "meaning": "One who has taken birth is sure to die, and after death one is sure to take birth again. Therefore, in the unavoidable discharge of your duty, you should not lament.",
    "source": "Bhagavad Gita 2.27"
  },
  {
    "shloka": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
    "meaning": "Whenever and wherever there is a decline in religious practice, O descendant of Bharata, and a predominant rise of irreligion – at that time I descend myself.",
    "source": "Bhagavad Gita 4.7"
  },
  {
    "shloka": "परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥",
    "meaning": "To deliver the pious and to annihilate the miscreants, as well as to reestablish the principles of religion, I advent myself millennium after millennium.",
    "source": "Bhagavad Gita 4.8"
  },
  {
    "shloka": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
    "meaning": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
    "source": "Bhagavad Gita 18.66"
  },
  {
    "shloka": "मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु। मामेवैष्यसि युक्त्वैवमात्मानं मत्परायणः॥",
    "meaning": "Engage your mind always in thinking of Me, become My devotee, offer obeisances to Me and worship Me. Being completely absorbed in Me, surely you will come to Me.",
    "source": "Bhagavad Gita 9.34"
  },
  {
    "shloka": "अहं सर्वस्य प्रभवो मत्तः सर्वं प्रवर्तते। इति मत्वा भजन्ते मां बुधा भावसमन्विताः॥",
    "meaning": "I am the source of all spiritual and material worlds. Everything emanates from Me. The wise who perfectly know this engage in My devotional service and worship Me with all their hearts.",
    "source": "Bhagavad Gita 10.8"
  },
  {
    "shloka": "मच्चित्ता मद्गतप्राणा बोधयन्तः परस्परम्। कथयन्तश्च मां नित्यं तुष्यन्ति च रमन्ति च॥",
    "meaning": "The thoughts of My pure devotees dwell in Me, their lives are surrendered to Me, and they derive great satisfaction and bliss enlightening one another and conversing about Me.",
    "source": "Bhagavad Gita 10.9"
  },
  {
    "shloka": "तेषां सततयुक्तानां भजतां प्रीतिपूर्वकम्। ददामि बुद्धियोगं तं येन मामुपयान्ति ते॥",
    "meaning": "To those who are constantly devoted and worship Me with love, I give the understanding by which they can come to Me.",
    "source": "Bhagavad Gita 10.10"
  },
  {
    "shloka": "तेषामेवानुकम्पार्थमहमज्ञानजं तमः। नाशयाम्यात्मभावस्थो ज्ञानदीपेन भास्वता॥",
    "meaning": "Out of compassion for them, I, dwelling in their hearts, destroy with the shining lamp of knowledge the darkness born of ignorance.",
    "source": "Bhagavad Gita 10.11"
  },
  {
    "shloka": "चतुर्विधा भजन्ते मां जनाः सुकृतिनोऽर्जुन। आर्तो जिज्ञासुरर्थार्थी ज्ञानी च भरतर्षभ॥",
    "meaning": "O best among the Bharatas, four kinds of pious men begin to render devotional service unto Me—the distressed, the desirer of wealth, the inquisitive, and he who is searching for knowledge of the Absolute.",
    "source": "Bhagavad Gita 7.16"
  },
  {
    "shloka": "तेषां ज्ञानी नित्ययुक्त एकभक्तिर्विशिष्यते। प्रियो हि ज्ञानिनोऽत्यर्थमहं स च मम प्रियः॥",
    "meaning": "Of these, the one who is in knowledge and who is always engaged in pure devotional service is the best. For I am very dear to him, and he is dear to Me.",
    "source": "Bhagavad Gita 7.17"
  },
  {
    "shloka": "उदाराः सर्व एवैते ज्ञानी त्वात्मैव मे मतम्। आस्थितः स हि युक्तात्मा मामेवानुत्तमां गतिम्॥",
    "meaning": "All these devotees are undoubtedly magnanimous souls, but he who is situated in knowledge of Me I consider to be just like My own self. Being engaged in My transcendental service, he attains Me.",
    "source": "Bhagavad Gita 7.18"
  },
  {
    "shloka": "बहूनां जन्मनामन्ते ज्ञानवान्मां प्रपद्यते। वासुदेवः सर्वमिति स महात्मा सुदुर्लभः॥",
    "meaning": "After many births and deaths, he who is actually in knowledge surrenders unto Me, knowing Me to be the cause of all causes and all that is. Such a great soul is very rare.",
    "source": "Bhagavad Gita 7.19"
  },
  {
    "shloka": "यो मां पश्यति सर्वत्र सर्वं च मयि पश्यति। तस्याहं न प्रणश्यामि स च मे न प्रणश्यति॥",
    "meaning": "For one who sees Me everywhere and sees everything in Me, I am never lost, nor is he ever lost to Me.",
    "source": "Bhagavad Gita 6.30"
  },
  {
    "shloka": "सर्वभूतस्थितं यो मां भजत्येकत्वमास्थितः। सर्वथा वर्तमानोऽपि स योगी मयि वर्तते॥",
    "meaning": "The yogi who knows that I and the Supersoul within all creatures are one worships Me and remains always in Me in all circumstances.",
    "source": "Bhagavad Gita 6.31"
  },
  {
    "shloka": "आत्मौपम्येन सर्वत्र समं पश्यति योऽर्जुन। सुखं वा यदि वा दुःखं स योगी परमो मतः॥",
    "meaning": "He is a perfect yogi who, by comparison to his own self, sees the true equality of all beings, in both their happiness and their distress, O Arjuna!",
    "source": "Bhagavad Gita 6.32"
  },
  {
    "shloka": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
    "meaning": "But those who worship Me with devotion, meditating on My transcendental form—to them I carry what they lack and preserve what they have.",
    "source": "Bhagavad Gita 9.22"
  },
  {
    "shloka": "ये यथा मां प्रपद्यन्ते तांस्तथैव भजाम्यहम्। मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः॥",
    "meaning": "All of them—as they surrender unto Me—I reward accordingly. Everyone follows My path in all respects, O son of Pritha.",
    "source": "Bhagavad Gita 4.11"
  },
  {
    "shloka": "न हि ज्ञानेन सदृशं पवित्रमिह विद्यते। तत्स्वयं योगसंसिद्धः कालेनात्मनि विन्दति॥",
    "meaning": "In this world, there is nothing so sublime and pure as transcendental knowledge. Such knowledge is the mature fruit of all mysticism. And one who has achieved this enjoys the self within himself in due course of time.",
    "source": "Bhagavad Gita 4.38"
  },
  {
    "shloka": "श्रद्धावाँल्लभते ज्ञानं तत्परः संयतेन्द्रियः। ज्ञानं लब्ध्वा परां शान्तिमचिरेणाधिगच्छति॥",
    "meaning": "A faithful man who is dedicated to transcendental knowledge and who subdues his senses is eligible to achieve such knowledge, and having achieved it he quickly attains the supreme spiritual peace.",
    "source": "Bhagavad Gita 4.39"
  },
  {
    "shloka": "अज्ञश्चाश्रद्दधानश्च संशयात्मा विनश्यति। नायं लोकोऽस्ति न परो न सुखं संशयात्मनः॥",
    "meaning": "But ignorant and faithless persons who doubt the revealed scriptures do not attain God consciousness; they fall down. For the doubting soul there is happiness neither in this world nor in the next.",
    "source": "Bhagavad Gita 4.40"
  },
  {
    "shloka": "योगसन्न्यस्तकर्माणं ज्ञानसञ्छिन्नसंशयम्। आत्मवन्तं न कर्माणि निबध्नन्ति धनञ्जय॥",
    "meaning": "One who acts in devotional service, renouncing the fruits of his actions, and whose doubts have been destroyed by transcendental knowledge, is situated factually in the self. Thus he is not bound by the reactions of work, O conqueror of wealth.",
    "source": "Bhagavad Gita 4.41"
  },
  {
    "shloka": "तस्मादज्ञानसम्भूतं हृत्स्थं ज्ञानासिनात्मनः। छित्त्वैनं संशयं योगमातिष्ठोत्तिष्ठ भारत॥",
    "meaning": "Therefore, the doubts which have arisen in your heart out of ignorance should be slashed by the weapon of knowledge. Armed with yoga, O Bharata, stand and fight.",
    "source": "Bhagavad Gita 4.42"
  },
  {
    "shloka": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः। मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः॥",
    "meaning": "The working senses are superior to dull matter; mind is higher than the senses; intelligence is still higher than the mind; and he [the soul] is even higher than the intelligence.",
    "source": "Bhagavad Gita 3.42"
  },
  {
    "shloka": "एवं बुद्धेः परं बुद्ध्वा संस्तभ्यात्मानमात्मना। जहि शत्रुं महाबाहो कामरूपं दुरासदम्॥",
    "meaning": "Thus knowing oneself to be transcendental to the material senses, mind and intelligence, O mighty-armed Arjuna, one should steady the mind by deliberate spiritual intelligence and thus—by spiritual strength—conquer this insatiable enemy known as lust.",
    "source": "Bhagavad Gita 3.43"
  },
  {
    "shloka": "श्रेयान्द्रव्यमयाद्यज्ञाज्ज्ञानयज्ञः परन्तप। सर्वं कर्माखिलं पार्थ ज्ञाने परिसमाप्यते॥",
    "meaning": "O chastiser of the enemy, the sacrifice of knowledge is greater than the sacrifice of material possessions. O son of Pritha, after all, the sacrifice of work culminates in transcendental knowledge.",
    "source": "Bhagavad Gita 4.33"
  },
  {
    "shloka": "तद्विद्धि प्रणिपातेन परिप्रश्नेन सेवया। उपदेक्ष्यन्ति ते ज्ञानं ज्ञानिनस्तत्त्वदर्शिनः॥",
    "meaning": "Just try to learn the truth by approaching a spiritual master. Inquire from him submissively and render service unto him. The self-realized souls can impart knowledge unto you because they have seen the truth.",
    "source": "Bhagavad Gita 4.34"
  },
  {
    "shloka": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः। तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर॥",
    "meaning": "Work done as a sacrifice for Vishnu has to be performed, otherwise work causes bondage in this material world. Therefore, O son of Kunti, perform your prescribed duties for His satisfaction, and in that way you will always remain free from bondage.",
    "source": "Bhagavad Gita 3.9"
  },
  {
    "shloka": "सहयज्ञाः प्रजाः सृष्ट्वा पुरोवाच प्रजापतिः। अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक्॥",
    "meaning": "In the beginning of creation, the Lord of all creatures sent forth generations of men and demigods, along with sacrifices for Vishnu, and blessed them by saying, 'Be thou happy by this yajna [sacrifice] because its performance will bestow upon you everything desirable for living happily and achieving liberation.'",
    "source": "Bhagavad Gita 3.10"
  },
  {
    "shloka": "देवान्भावयतानेन ते देवा भावयन्तु वः। परस्परं भावयन्तः श्रेयः परमवाप्स्यथ॥",
    "meaning": "The demigods, being pleased by sacrifices, will also please you, and thus, by cooperation between men and demigods, prosperity will reign for all.",
    "source": "Bhagavad Gita 3.11"
  },
  {
    "shloka": "इष्टान्भोगान्हि वो देवा दास्यन्ते यज्ञभाविताः। तैर्दत्तानप्रदायैभ्यो यो भुङ्क्ते स्तेन एव सः॥",
    "meaning": "In charge of the various necessities of life, the demigods, being satisfied by the performance of yajna [sacrifice], will supply all necessities to you. But he who enjoys such gifts without offering them to the demigods in return is certainly a thief.",
    "source": "Bhagavad Gita 3.12"
  },
  {
    "shloka": "यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः। भुञ्जते ते त्वघं पापा ये पचन्त्यात्मकारणात्॥",
    "meaning": "The devotees of the Lord are released from all kinds of sins because they eat food which is offered first for sacrifice. Others, who prepare food for personal sense enjoyment, verily eat only sin.",
    "source": "Bhagavad Gita 3.13"
  },
  {
    "shloka": "अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः। यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः॥",
    "meaning": "All living bodies subsist on food grains, which are produced from rains. Rains are produced by performance of yajna [sacrifice], and yajna is born of prescribed duties.",
    "source": "Bhagavad Gita 3.14"
  },
  {
    "shloka": "कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम्। तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम्॥",
    "meaning": "Regulated activities are prescribed in the Vedas, and the Vedas are directly manifested from the Supreme Personality of Godhead. Consequently the all-pervading Transcendence is eternally situated in acts of sacrifice.",
    "source": "Bhagavad Gita 3.15"
  },
  {
    "shloka": "एवं प्रवर्तितं चक्रं नानुवर्तयतीह यः। अघायुरिन्द्रियारामो मोघं पार्थ स जीवति॥",
    "meaning": "My dear Arjuna, one who does not follow in human life the cycle of sacrifice thus established by the Vedas certainly leads a life full of sin and lives only for the satisfaction of the senses.",
    "source": "Bhagavad Gita 3.16"
  },
  {
    "shloka": "यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः। आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते॥",
    "meaning": "But for one who takes pleasure in the self, whose human life is one of self-realization, and who is satisfied in the self only, fully satiated—for him there is no duty.",
    "source": "Bhagavad Gita 3.17"
  },
  {
    "shloka": "नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन। न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः॥",
    "meaning": "A self-realized man has no purpose to fulfill in the discharge of his prescribed duties, nor has he any reason not to perform such work. Nor has he any need to depend on any other living being.",
    "source": "Bhagavad Gita 3.18"
  },
  {
    "shloka": "तस्मादसक्तः सततं कार्यं कर्म समाचर। असक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः॥",
    "meaning": "Therefore, without being attached to the fruits of activities, one should act as a matter of duty, for by working without attachment one attains the Supreme.",
    "source": "Bhagavad Gita 3.19"
  },
  {
    "shloka": "कर्मणैव हि संसिद्धिमास्थिता जनकादयः। लोकसंग्रहमेवापि सम्पश्यन्कर्तुमर्हसि॥",
    "meaning": "Kings such as Janaka attained perfection solely by performance of prescribed duties. Therefore, just for the sake of educating the people in general, you should perform your work.",
    "source": "Bhagavad Gita 3.20"
  },
  {
    "shloka": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥",
    "meaning": "Whatever action a great man performs, common men follow. And whatever standards he sets by exemplary acts, all the world pursues.",
    "source": "Bhagavad Gita 3.21"
  },
  {
    "shloka": "न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किञ्चन। नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि॥",
    "meaning": "O son of Pritha, there is no work prescribed for Me within all the three planetary systems. Nor am I in want of anything, nor have I a need to obtain anything—and yet I am engaged in work.",
    "source": "Bhagavad Gita 3.22"
  },
  {
    "shloka": "यदि ह्यहं न वर्तेयं जातु कर्मण्यतन्द्रितः। मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः॥",
    "meaning": "For if I ever failed to engage in carefully performed duties, O Partha, certainly all men would follow My path.",
    "source": "Bhagavad Gita 3.23"
  },
  {
    "shloka": "उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम्। सङ्करस्य च कर्ता स्यामुपहन्यामिमाः प्रजाः॥",
    "meaning": "If I did not perform prescribed duties, all these worlds would be put to ruination. I would be the cause of creating unwanted population, and I would thereby destroy the peace of all living beings.",
    "source": "Bhagavad Gita 3.24"
  },
  {
    "shloka": "सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत। कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसंग्रहम्॥",
    "meaning": "As the ignorant perform their duties with attachment to results, the learned may similarly act, but without attachment, for the sake of leading people on the right path.",
    "source": "Bhagavad Gita 3.25"
  },
  {
    "shloka": "न बुद्धिभेदं जनयेदज्ञानां कर्मसङ्गिनाम्। जोषयेत्सर्वकर्माणि विद्वान्युक्तः समाचरन्॥",
    "meaning": "So as not to disrupt the minds of ignorant men attached to the fruitive results of prescribed duties, a learned person should not induce them to stop work. Rather, by working in the spirit of devotion, he should engage them in all sorts of activities [for the gradual development of Krishna consciousness].",
    "source": "Bhagavad Gita 3.26"
  },
  {
    "shloka": "प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः। अहङ्कारविमूढात्मा कर्ताहमिति मन्यते॥",
    "meaning": "The spirit soul bewildered by the influence of false ego thinks himself the doer of activities that are in actuality carried out by the three modes of material nature.",
    "source": "Bhagavad Gita 3.27"
  },
  {
    "shloka": "तत्त्ववित्तु महाबाहो गुणकर्मविभागयोः। गुणा गुणेषु वर्तन्त इति मत्वा न सज्जते॥",
    "meaning": "One who is in knowledge of the Absolute Truth, O mighty-armed, does not engage himself in the senses and sense gratification, knowing well the differences between work in devotion and work for fruitive results.",
    "source": "Bhagavad Gita 3.28"
  },
  {
    "shloka": "प्रकृतेर्गुणसम्मूढाः सज्जन्ते गुणकर्मसु। तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालयेत्॥",
    "meaning": "Bewildered by the modes of material nature, the ignorant fully engage themselves in material activities and become attached. But the wise should not unsettle them, although these duties are inferior due to the performers' lack of knowledge.",
    "source": "Bhagavad Gita 3.29"
  },
  {
    "shloka": "मयि सर्वाणि कर्माणि संन्यस्याध्यात्मचेतसा। निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वरः॥",
    "meaning": "Therefore, O Arjuna, surrendering all your works unto Me, with full knowledge of Me, without desires for profit, with no claims to proprietorship, and free from lethargy, fight.",
    "source": "Bhagavad Gita 3.30"
  },
  {
    "shloka": "ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः। श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽपि कर्मभिः॥",
    "meaning": "Those persons who execute their duties according to My injunctions and who follow this teaching faithfully, without envying, are freed from the bondage of fruitive actions.",
    "source": "Bhagavad Gita 3.31"
  },
  {
    "shloka": "ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम्। सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतसः॥",
    "meaning": "But those who, out of envy, disregard these teachings and do not follow them regularly are to be considered bereft of all knowledge, befooled, and ruined in their endeavors for perfection.",
    "source": "Bhagavad Gita 3.32"
  },
  {
    "shloka": "सदृशं चेष्टते स्वस्याः प्रकृतेर्ज्ञानवानपि। प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति॥",
    "meaning": "Even a man of knowledge acts according to his own nature, for everyone follows the nature he has acquired from the three modes. What can repression accomplish?",
    "source": "Bhagavad Gita 3.33"
  },
  {
    "shloka": "इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ। तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ॥",
    "meaning": "There are principles to regulate attachment and aversion pertaining to the senses and their objects. One should not come under the control of such attachment and aversion, because they are stumbling blocks on the path of self-realization.",
    "source": "Bhagavad Gita 3.34"
  },
  {
    "shloka": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः॥",
    "meaning": "It is far better to discharge one's prescribed duties, even though faultily, than another's duties perfectly. Destruction in the course of performing one's own duty is better than engaging in another's duties, for to follow another's path is dangerous.",
    "source": "Bhagavad Gita 3.35"
  },
  {
    "shloka": "अर्जुन उवाच अथ केन प्रयुक्तोऽयं पापं चरति पूरुषः। अनिच्छन्नपि वार्ष्णेय बलादिव नियोजितः॥",
    "meaning": "Arjuna said: O descendant of Vrishni, by what is one impelled to sinful acts, even unwillingly, as if engaged by force?",
    "source": "Bhagavad Gita 3.36"
  },
  {
    "shloka": "श्रीभगवानुवाच काम एष क्रोध एष रजोगुणसमुद्भवः। महाशनो महापाप्मा विद्ध्येनमिह वैरिणम्॥",
    "meaning": "The Supreme Personality of Godhead said: It is lust only, Arjuna, which is born of contact with the material mode of passion and later transformed into wrath, and which is the all-devouring sinful enemy of this world.",
    "source": "Bhagavad Gita 3.37"
  },
  {
    "shloka": "धूमेनाव्रियते वह्निर्यथादर्शो मलेन च। यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम्॥",
    "meaning": "As fire is covered by smoke, as a mirror is covered by dust, and as the embryo is covered by the womb, the living entity is similarly covered by different degrees of this lust.",
    "source": "Bhagavad Gita 3.38"
  },
  {
    "shloka": "आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा। कामरूपेण कौन्तेय दुष्पूरेणानलेन च॥",
    "meaning": "Thus the wise living entity's pure consciousness becomes covered by his eternal enemy in the form of lust, which is never satisfied and which burns like fire.",
    "source": "Bhagavad Gita 3.39"
  },
  {
    "shloka": "इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते। एतैर्विमोहयत्येष ज्ञानमावृत्य देहिनम्॥",
    "meaning": "The senses, the mind and the intelligence are the sitting places of this lust. Through them lust covers the real knowledge of the living entity and bewilders him.",
    "source": "Bhagavad Gita 3.40"
  },
  {
    "shloka": "तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ। पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम्॥",
    "meaning": "Therefore, O Arjuna, best of the Bharatas, in the very beginning curb this great symbol of sin [lust] by regulating the senses, and slay this destroyer of knowledge and self-realization.",
    "source": "Bhagavad Gita 3.41"
  },
  {
    "shloka": "उध्वरेत्वेव कौन्तेय पुरुषेण वरेण च। नाधमेन प्रसाक्तेन स्वर्गिणो नरकेऽपि वा॥",
    "meaning": "Therefore, O Arjuna, best of the Bharatas, in the very beginning curb this great symbol of sin [lust] by regulating the senses, and slay this destroyer of knowledge and self-realization.",
    "source": "Bhagavad Gita 3.41"
  },
  {
    "shloka": "श्रीभगवानुवाच इमं विवस्वते योगं प्रोक्तवानहमव्ययम्। विवस्वान्मनवे प्राह मनुरिक्ष्वाकवेऽब्रवीत्॥",
    "meaning": "The Personality of Godhead said: I instructed this imperishable science of yoga to the sun-god, Vivasvan, and Vivasvan instructed it to Manu, the father of mankind, and Manu in turn instructed it to Ikshvaku.",
    "source": "Bhagavad Gita 4.1"
  },
  {
    "shloka": "एवं परम्पराप्राप्तमिमं राजर्षयो विदुः। स कालेनेह महता योगो नष्टः परन्तप॥",
    "meaning": "This supreme science was thus received through the chain of disciplic succession, and the saintly kings understood it in that way. But in course of time the succession was broken, and therefore the science as it is appears to be lost.",
    "source": "Bhagavad Gita 4.2"
  },
  {
    "shloka": "स एवायं मया तेऽद्य योगः प्रोक्तः पुरातनः। भक्तोऽसि मे सखा चेति रहस्यं ह्येतदुत्तमम्॥",
    "meaning": "That very ancient science of the relationship with the Supreme is today told by Me to you because you are My devotee as well as My friend and can therefore understand the transcendental mystery of this science.",
    "source": "Bhagavad Gita 4.3"
  },
  {
    "shloka": "अर्जुन उवाच अपरं भवतो जन्म परं जन्म विवस्वतः। कथमेतद्विजानीयां त्वमादौ प्रोक्तवानिति॥",
    "meaning": "Arjuna said: The sun-god Vivasvan is senior by birth to You. How am I to understand that in the beginning You instructed this science to him?",
    "source": "Bhagavad Gita 4.4"
  },
  {
    "shloka": "श्रीभगवानुवाच बहूनि मे व्यतीतानि जन्मानि तव चार्जुन। तान्यहं वेद सर्वाणि न त्वं वेत्थ परन्तप॥",
    "meaning": "The Personality of Godhead said: Many, many births both you and I have passed. I can remember all of them, but you cannot, O subduer of the enemy!",
    "source": "Bhagavad Gita 4.5"
  },
  {
    "shloka": "अजोऽपि सन्नव्ययात्मा भूतानामीश्वरोऽपि सन्। प्रकृतिं स्वामधिष्ठाय सम्भवाम्यात्ममायया॥",
    "meaning": "Although I am unborn and My transcendental body never deteriorates, and although I am the Lord of all living entities, I still appear in every millennium in My original transcendental form.",
    "source": "Bhagavad Gita 4.6"
  },
  {
    "shloka": "जन्म कर्म च मे दिव्यमेवं यो वेत्ति तत्त्वतः। त्यक्त्वा देहं पुनर्जन्म नैति मामेति सोऽर्जुन॥",
    "meaning": "One who knows the transcendental nature of My appearance and activities does not, upon leaving the body, take his birth again in this material world, but attains My eternal abode, O Arjuna.",
    "source": "Bhagavad Gita 4.9"
  },
  {
    "shloka": "वीतरागभयक्रोधा मन्मया मामुपाश्रिताः। बहवो ज्ञानतपसा पूता मद्भावमागताः॥",
    "meaning": "Being freed from attachment, fear and anger, being fully absorbed in Me and taking refuge in Me, many, many persons in the past became purified by knowledge of Me—and thus they all attained transcendental love for Me.",
    "source": "Bhagavad Gita 4.10"
  },
  {
    "shloka": "काङ्क्षन्तः कर्मणां सिद्धिं यजन्त इह देवताः। क्षिप्रं हि मानुषे लोके सिद्धिर्भवति कर्मजा॥",
    "meaning": "Men in this world desire success in fruitive activities, and therefore they worship the demigods. Quickly, indeed, men get results from fruitive work in this world.",
    "source": "Bhagavad Gita 4.12"
  },
  {
    "shloka": "चातुर्वर्ण्यं मया सृष्टं गुणकर्मविभागशः। तस्य कर्तारमपि मां विद्ध्यकर्तारमव्ययम्॥",
    "meaning": "According to the three modes of material nature and the work associated with them, the four divisions of human society are created by Me. And although I am the creator of this system, you should know that I am yet the nondoer, being unchangeable.",
    "source": "Bhagavad Gita 4.13"
  },
  {
    "shloka": "न मां कर्माणि लिम्पन्ति न मे कर्मफले स्पृहा। इति मां योऽभिजानाति कर्मभिर्न स बध्यते॥",
    "meaning": "There is no work that affects Me; nor do I aspire for the fruits of action. One who understands this truth about Me also does not become entangled in the fruitive reactions of work.",
    "source": "Bhagavad Gita 4.14"
  },
  {
    "shloka": "एवं ज्ञात्वा कृतं कर्म पूर्वैरपि मुमुक्षुभिः। कुरु कर्मैव तस्मात्त्वं पूर्वैः पूर्वतरं कृतम्॥",
    "meaning": "In ancient times all the liberated souls acted with this understanding of My transcendental nature. Therefore you should perform your duty, following in their footsteps.",
    "source": "Bhagavad Gita 4.15"
  },
  {
    "shloka": "किं कर्म किमकर्मेति कवयोऽप्यत्र मोहिताः। तत्ते कर्म प्रवक्ष्यामि यज्ज्ञात्वा मोक्ष्यसेऽशुभात्॥",
    "meaning": "Even the intelligent are bewildered in determining what is action and what is inaction. Now I shall explain to you what action is, knowing which you shall be liberated from all misfortune.",
    "source": "Bhagavad Gita 4.16"
  },
  {
    "shloka": "कर्मणो ह्यपि बोद्धव्यं बोद्धव्यं च विकर्मणः। अकर्मणश्च बोद्धव्यं गहना कर्मणो गतिः॥",
    "meaning": "The intricacies of action are very hard to understand. Therefore one should know properly what action is, what forbidden action is, and what inaction is.",
    "source": "Bhagavad Gita 4.17"
  },
  {
    "shloka": "कर्मण्यकर्म यः पश्येदकर्मणि च कर्म यः। स बुद्धिमान्मनुष्येषु स युक्तः कृत्स्नकर्मकृत्॥",
    "meaning": "One who sees inaction in action, and action in inaction, is intelligent among men, and he is in the transcendental position, although engaged in all sorts of activities.",
    "source": "Bhagavad Gita 4.18"
  },
  {
    "shloka": "यस्य सर्वे समारम्भाः कामसंकल्पवर्जिताः। ज्ञानाग्निदग्धकर्माणं तमाहुः पण्डितं बुधाः॥",
    "meaning": "One is understood to be in full knowledge whose every endeavor is devoid of desire for sense gratification. He is said by sages to be a worker for whom the reactions of work have been burned up by the fire of perfect knowledge.",
    "source": "Bhagavad Gita 4.19"
  },
  {
    "shloka": "त्यक्त्वा कर्मफलासङ्गं नित्यतृप्तो निराश्रयः। कर्मण्यभिप्रवृत्तोऽपि नैव किञ्चित्करोति सः॥",
    "meaning": "Abandoning all attachment to the results of his activities, ever satisfied and independent, he performs no fruitive action, although engaged in all kinds of undertakings.",
    "source": "Bhagavad Gita 4.20"
  },
  {
    "shloka": "निराशीर्यतचित्तात्मा त्यक्तसर्वपरिग्रहः। शारीरं केवलं कर्म कुर्वन्नाप्नोति किल्बिषम्॥",
    "meaning": "Such a man of understanding acts with mind and intelligence perfectly controlled, gives up all sense of proprietorship over his possessions, and acts only for the bare necessities of life. Thus working, he is not affected by sinful reactions.",
    "source": "Bhagavad Gita 4.21"
  },
  {
    "shloka": "यद्यच्छया लाभसन्तुष्टो द्वन्द्वातीतो विमत्सरः। समः सिद्धावसिद्धौ च कृत्वापि न निबध्यते॥",
    "meaning": "He who is satisfied with gain which comes of its own accord, who is free from duality and does not envy, who is steady in both success and failure, is never entangled, although performing actions.",
    "source": "Bhagavad Gita 4.22"
  },
  {
    "shloka": "गतसङ्गस्य मुक्तस्य ज्ञानावस्थितचेतसः। यज्ञायाचरतः कर्म समग्रं प्रविलीयते॥",
    "meaning": "The work of a man who is unattached to the modes of material nature and who is fully situated in transcendental knowledge merges entirely into transcendence.",
    "source": "Bhagavad Gita 4.23"
  },
  {
    "shloka": "ब्रह्मार्पणं ब्रह्महविर्ब्रह्माग्नौ ब्रह्मणा हुतम्। ब्रह्मैव तेन गन्तव्यं ब्रह्मकर्मसमाधिना॥",
    "meaning": "A person who is fully absorbed in Krishna consciousness is sure to attain the spiritual kingdom because of his full contribution to spiritual activities, in which the consummation is absolute and that which is offered is of the same spiritual nature.",
    "source": "Bhagavad Gita 4.24"
  },
  {
    "shloka": "दैवमेवापरे यज्ञं योगिनः पर्युपासते। ब्रह्माग्नावपरे यज्ञं यज्ञेनैवोपजुह्वति॥",
    "meaning": "Some yogis perfectly worship the demigods by offering different sacrifices to them, and some offer sacrifices in the fire of the Supreme Brahman.",
    "source": "Bhagavad Gita 4.25"
  },
  {
    "shloka": "श्रोत्रादीनीन्द्रियाण्यन्ये संयमाग्निषु जुह्वति। शब्दादीन्विषयानन्य इन्द्रियाग्निषु जुह्वति॥",
    "meaning": "Some [the unadulterated brahmacaris] sacrifice the hearing process and the senses in the fire of mental control, and others [the regulated householders] sacrifice the objects of the senses such as sound in the fire of the senses.",
    "source": "Bhagavad Gita 4.26"
  },
  {
    "shloka": "सर्वाणीन्द्रियकर्माणि प्राणकर्माणि चापरे। आत्मसंयमयोगाग्नौ जुह्वति ज्ञानदीपिते॥",
    "meaning": "Others, who are interested in achieving self-realization through control of the mind and senses, offer the functions of all the senses, and of the life force, as oblations into the fire of the controlled mind.",
    "source": "Bhagavad Gita 4.27"
  },
  {
    "shloka": "द्रव्ययज्ञास्तपोयज्ञा योगयज्ञास्तथापरे। स्वाध्यायज्ञानयज्ञाश्च यतयः संशितव्रताः॥",
    "meaning": "Having accepted strict vows, some become enlightened by sacrificing their possessions, and others by performing severe austerities, by practicing the yoga of eightfold mysticism, or by studying the Vedas to advance in transcendental knowledge.",
    "source": "Bhagavad Gita 4.28"
  },
  {
    "shloka": "अपाने जुह्वति प्राणं प्राणेऽपानं तथापरे। प्राणापानगती रुद्ध्वा प्राणायामपरायणाः॥",
    "meaning": "Still others, who are inclined to the process of breath restraint to remain in trance, practice by offering the movement of the outgoing breath into the incoming, and the incoming breath into the outgoing, and thus at last remain in trance, stopping all breathing.",
    "source": "Bhagavad Gita 4.29"
  },
  {
    "shloka": "अपरे नियताहाराः प्राणान्प्राणेषु जुह्वति। सर्वेऽप्येते यज्ञविदो यज्ञक्षपितकल्मषाः॥",
    "meaning": "Others, who are self-controlled in regard to food, sacrifice the outgoing breath in the outgoing breath. All these performers of different types of sacrifice are conversant with sacrifice, and their sinful reactions are washed away as the result of such performances.",
    "source": "Bhagavad Gita 4.30"
  },
  {
    "shloka": "यज्ञशिष्टामृतभुजो यान्ति ब्रह्म सनातनम्। नायं लोकोऽस्त्ययज्ञस्य कुतोऽन्यः कुरुसत्तम॥",
    "meaning": "Those who eat the remnants of sacrifice are relieved from all kinds of sin, but those who cook food for their own sense enjoyment eat only sin.",
    "source": "Bhagavad Gita 4.31"
  },
  {
    "shloka": "एवं बहुविधा यज्ञा वितता ब्रह्मणो मुखे। कर्मजान्विद्धि तान्सर्वानेवं ज्ञात्वा विमोक्ष्यसे॥",
    "meaning": "All these different types of sacrifice are approved by the Vedas, and all of them are born of different types of work. Knowing them as such, you will become liberated.",
    "source": "Bhagavad Gita 4.32"
  },
  {
    "shloka": "यज्ञेन यज्ञमयजन्तो देवास्ते धर्मा आसन्। तेऽग्रे बहूनां प्रजानां रक्षन्तस्तारयन्तीह॥",
    "meaning": "In the beginning of creation, the Lord of all creatures sent forth generations of men and demigods, along with sacrifices for Vishnu, and blessed them by saying, 'Be thou happy by this yajna [sacrifice] because its performance will bestow upon you everything desirable for living happily and achieving liberation.'",
    "source": "Bhagavad Gita 4.32"
  }
]
